Revit 2024 API
BuiltInFailures.ViewFailures.DetailNumberDuplicate Property
 Detail Number is already in use. Enter a unique number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DetailNumberDuplicate { get; }
Visual Basic
Public Shared ReadOnly Property DetailNumberDuplicate As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DetailNumberDuplicate {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace